0hello-bit/Robot_twin/数字孪生/firmware/stm32_line_follower/User/main.c
    /* Starting CIPSEND is not delivery evidence; wait for SEND OK. */
    if (cipsend_tx_is_terminal(&g_cipsend_tx)) {
        terminal_tag = cipsend_tx_tag(&g_cipsend_tx);
        terminal_result = cipsend_tx_result(&g_cipsend_tx);
    }

    /* Delegates to the extracted pure-logic function in esp_tx_coordinator,
       which is Host-testable via the same production code path.  See
       tx_boundary_design_decision.md §4 and §9. */
    etc_handle_terminal(&g_coordinator, mono_now_ms());

    /* Only SEND OK commits the in-flight telemetry prefix.  Error/timeout
       leaves it owned by telemetry_delivery for a same-connection retry;
       CLOSED has already cleared it through the coordinator callback. */
    if (terminal_tag == CIPSEND_TX_TAG_TELEMETRY
        && terminal_result == CTS_RESULT_OK) {
        telemetry_delivery_commit_success(&s_tele_delivery);
    } else if (terminal_tag == CIPSEND_TX_TAG_TELEMETRY
               && terminal_result != CTS_RESULT_CLOSED) {
        telemetry_delivery_retain_failure(&s_tele_delivery);
    }

    /* A pending clock sample remains retryable until the fixed-length
       response receives SEND OK.  Command acceptance, prompt receipt, and
       payload preparation are not delivery evidence. */
    if (terminal_tag == CIPSEND_TX_TAG_CLOCK_SYNC
        && terminal_result == CTS_RESULT_OK) {
        esp_transport_consume_pending_clock_sync();
    }

    if (imu_diagnostic_delivery_confirmed(terminal_tag, terminal_result)) {
        s_imu_diag_pending = 0U;
    }
}

/* Phase 1: drain RX ring, route every byte to both the transport
   (CONNECT/CLOSED/+IPD) and the TX state machine ('>' / SEND OK parse). */
static void ESP_ServiceRX(void)
{
    uint8_t ch;
    while (uart_ring_pop(&g_uart_ring, &ch)) {
        esp_transport_set_now_ms(mono_now_ms());
        esp_transport_process_byte(ch);        /* CONNECT/CLOSED/+IPD 输入路径 */
        cipsend_tx_feed_byte(&g_cipsend_tx, ch); /* TX 事务 '>' / SEND OK 解析 */
    }
}

/* Phase 2+3: check connection boundary, then push TX + handle terminal.
   Must run AFTER ESP_ServiceRX (which may have detected CONNECT/CLOSED)
   but BEFORE any main-loop logic that reads connection state. */
static void ESP_ServiceTX(void)
{
    uint32_t gen;
    /* Check boundary BEFORE pushing any TX bytes (see design decision §5).
       If a CONNECT arrived during ESP_ServiceRX, the coordinator discards
       the old CipsendTx, TX ring, tele slot, and A/S retry buffers so no
       old-epoch byte can reach the ESP. */
    (void)etc_check_boundary(&g_coordinator,
                             esp_transport_connection_generation(),
                             mono_now_ms());
    /* 连接代次变化 → 放弃旧代次待发健康帧（发送仲裁，不得发给新客户端）。 */
    gen = esp_transport_connection_generation();
    if (gen != s_last_tx_generation) {
        s_last_tx_generation = gen;
        hstats_health_epoch_changed(&g_health_stats);
    }
    cipsend_tx_tick(&g_cipsend_tx, mono_now_ms(), uart_tx_sink, NULL);
    ESP_TX_HandleTerminal();
}

/* 构建 31 字节遥测帧到 s_tele_frame（兼容旧 payload 布局）。 */
static void build_telemetry_frame(int16_t s0, int16_t s1, int16_t s2, int16_t s3,
                                   int16_t m1, int16_t m2, int16_t m3, int16_t m4,
                                   int16_t error, int16_t pid_output,
                                   uint32_t tick, int32_t yaw,
                                   uint8_t imu_validity)
{
    uint8_t type = 0x01;
    uint8_t len  = 26;
    uint8_t cs   = type ^ len;
    uint8_t i;
    int32_t yaw_int = yaw;

    s_tele_frame[4]  = (uint8_t)(s0 & 0xFF);
    s_tele_frame[5]  = (uint8_t)(s1 & 0xFF);
    s_tele_frame[6]  = (uint8_t)(s2 & 0xFF);
    s_tele_frame[7]  = (uint8_t)(s3 & 0xFF);
    s_tele_frame[8]  = (uint8_t)(m1 & 0xFF);        s_tele_frame[9]  = (uint8_t)((m1 >> 8) & 0xFF);
    s_tele_frame[10] = (uint8_t)(m2 & 0xFF);        s_tele_frame[11] = (uint8_t)((m2 >> 8) & 0xFF);
    s_tele_frame[12] = (uint8_t)(m3 & 0xFF);        s_tele_frame[13] = (uint8_t)((m3 >> 8) & 0xFF);
    s_tele_frame[14] = (uint8_t)(m4 & 0xFF);        s_tele_frame[15] = (uint8_t)((m4 >> 8) & 0xFF);
    s_tele_frame[16] = (uint8_t)(error & 0xFF);     s_tele_frame[17] = (uint8_t)((error >> 8) & 0xFF);
    s_tele_frame[18] = (uint8_t)(pid_output & 0xFF);s_tele_frame[19] = (uint8_t)((pid_output >> 8) & 0xFF);
    s_tele_frame[20] = (uint8_t)(tick & 0xFF);
    s_tele_frame[21] = (uint8_t)((tick >> 8) & 0xFF);
    s_tele_frame[22] = (uint8_t)((tick >> 16) & 0xFF);
    s_tele_frame[23] = (uint8_t)((tick >> 24) & 0xFF);
    s_tele_frame[24] = (uint8_t)(yaw_int & 0xFF);
    s_tele_frame[25] = (uint8_t)((yaw_int >> 8) & 0xFF);
    s_tele_frame[26] = (uint8_t)((yaw_int >> 16) & 0xFF);
    s_tele_frame[27] = (uint8_t)((yaw_int >> 24) & 0xFF);
    s_tele_frame[28] = imu_validity;
    s_tele_frame[29] = MPU6050_GetInitStatus();

    for (i = 4; i < 30; i++) cs ^= s_tele_frame[i];

    s_tele_frame[0] = 0xAA;
    s_tele_frame[1] = 0x55;
    s_tele_frame[2] = type;
    s_tele_frame[3] = len;
    s_tele_frame[30] = cs;
}

/* 尝试把待发遥测交给 TX 状态机（仅当空闲且无 critical 待发）。 */
static void ESP_TrySendTelemetry(void)
{
    char cmd[24];
    const TelemetryBatch *inflight;
    uint16_t batch_len;
    if (!telemetry_delivery_has_data(&s_tele_delivery)) return;
    if (hstats_health_due(&g_health_stats)) return;  /* 健康帧优先：让行（仲裁） */
    if (cipsend_tx_busy(&g_cipsend_tx)) return;
    if (twin_control_has_pending_status()) return;
    if (!etc_telemetry_dispatch_allowed(
            s_control_cycle_ready,
            txfq_has_retry(&g_tx_queue),
            esp_transport_has_pending_ack(),
            esp_transport_has_pending_status(),
            twin_control_has_pending_status())) {
        return;  /* A/S 优先, including frames queued later this loop */
    }
    if (!telemetry_delivery_prepare(&s_tele_delivery)) return;
    inflight = telemetry_delivery_inflight(&s_tele_delivery);
    if (inflight == NULL) return;
    batch_len = telemetry_batch_length(inflight);
    build_cipsend_cmd(cmd, batch_len);
    if (cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                         telemetry_batch_data(inflight), batch_len,
                         CIPSEND_TX_PRIORITY_DROPPABLE, CIPSEND_TX_TAG_TELEMETRY,
                         mono_now_ms())) {
        hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_TELEMETRY,
                          mono_now_ms());
    }
}

/* 遥测入队（pending FIFO）：由 ESP_TrySendTelemetry 择机批量发送。
   tick 为采样时的真实单调毫秒（mono_now_ms），不再是 g_loop_count*5。 */
static void Telemetry_Queue(int16_t s0, int16_t s1, int16_t s2, int16_t s3,
                            int16_t m1, int16_t m2, int16_t m3, int16_t m4,
                            int16_t error, int16_t pid_output,
                            uint32_t tick, int32_t yaw,
                            uint8_t imu_validity)
{
    uint8_t overwrote;
    if (!g_tcp_client_connected || g_tcp_client_id > 4) {
        telemetry_delivery_clear(&s_tele_delivery);
        return;
    }
    build_telemetry_frame(s0, s1, s2, s3, m1, m2, m3, m4,
                          error, pid_output, tick, yaw, imu_validity);
    if (telemetry_delivery_append(&s_tele_delivery, s_tele_frame,
                                  TELEMETRY_BATCH_FRAME_SIZE, &overwrote)) {
        hstats_telemetry_generated(&g_health_stats);
        if (overwrote) hstats_telemetry_overwritten(&g_health_stats);
        ESP_TrySendTelemetry();
    }
}

/* 发送二进制诊断帧。0x7E 旧诊断帧可丢弃；0x7D IMU 身份诊断帧
   保留到 SEND OK。若 TX 忙则本次放弃。
   Health baseline: 0x02 健康帧走 CIPSEND_TX_TAG_DIAG_HEALTH（专属归属）；
   0x7E 旧诊断帧仍走 CIPSEND_TX_TAG_DIAG。返回是否成功开启事务（start
   成功处触发 hstats_tx_started；失败由调用方记 health_dropped）。 */
static uint8_t ESP_SendDiagFrame(const uint8_t *frame, uint16_t frame_len)
{
    uint8_t tag;
    uint8_t started;
    char cmd[24];
    if (!g_tcp_client_connected || g_tcp_client_id > 4) return 0U;
    if (cipsend_tx_busy(&g_cipsend_tx)) return 0U;
    if (twin_control_has_pending_status()) return 0U;
    if (txfq_has_retry(&g_tx_queue)) return 0U;
    if (esp_transport_has_pending_ack()
        || esp_transport_has_pending_status()) return 0U;
    if (frame_len >= 4U && frame[2] == HEALTH_FRAME_TYPE) {
        tag = CIPSEND_TX_TAG_DIAG_HEALTH;
    } else if (frame_len >= 4U && frame[2] == IMU_DIAGNOSTIC_TYPE) {
        tag = CIPSEND_TX_TAG_IMU_DIAGNOSTIC;
    } else {
        tag = CIPSEND_TX_TAG_DIAG;
    }
    build_cipsend_cmd(cmd, frame_len);
    started = cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                               frame, frame_len,
                               CIPSEND_TX_PRIORITY_DROPPABLE, tag,
                               mono_now_ms());
    if (started) {
        hstats_tx_started(&g_health_stats, tag, mono_now_ms());
    }
    return started;
}

static void ESP_TrySendImuDiagnostic(void)
{
    ImuDiagnosticSnapshot snapshot;
    uint8_t frame[IMU_DIAGNOSTIC_FRAME_SIZE];

    if (!s_imu_diag_pending) return;

    snapshot.observed_id = MPU6050_GetObservedID();
    snapshot.init_status = MPU6050_GetInitStatus();
    snapshot.validity_flags = MPU6050_GetValidityFlags();
    snapshot.hardware_observed_id = MPU6050_GetHardwareObservedID();
    imu_diagnostic_encode(frame, &snapshot);

    /* Keep the pending flag on a busy/disconnected/blocked transport so the
       identity is still sent when the existing client path becomes idle. */
    (void)ESP_SendDiagFrame(frame, IMU_DIAGNOSTIC_FRAME_SIZE);
}

/* 发送队列（非阻塞）：ACK → STATUS → telemetry，严格串行。
   每次只尝试开启一个事务；失败时 critical 重试缓冲保留到下一轮。
   critical 帧的可靠性只在当前连接代次内保证：跨连接（代次改变 /
   CLOSED）时旧 ACK/STATUS 会被 txfq 丢弃，不会发给新客户端。 */
static void ESP_SendQueuedFrames(uint8_t allow_telemetry)
{
    char cmd[24];
    uint8_t ack_was_retained;
    uint8_t status_was_retained;
    if (!g_tcp_client_connected || g_tcp_client_id > 4) return;
    if (cipsend_tx_busy(&g_cipsend_tx)) return;

    /* --- ACK: retry existing or fetch new from transport ---
       Health baseline: 取新帧前 txfq_has_ack 已真 = 重发（上笔非 OK 终态）→
       hstats_ack_retry。 */
    ack_was_retained = txfq_has_ack(&g_tx_queue);
    if (!ack_was_retained && esp_transport_has_pending_ack()) {
        char tmp[TX_FRAME_QUEUE_LINE_MAX + 1U];
        uint16_t n = esp_transport_get_pending_ack(tmp, sizeof(tmp));
        txfq_retain_ack(&g_tx_queue, tmp, n);
    }
    if (txfq_has_ack(&g_tx_queue)) {
        if (ack_was_retained) hstats_ack_retry(&g_health_stats);
        build_cipsend_cmd(cmd, txfq_ack_len(&g_tx_queue));
        if (cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                             (const uint8_t *)txfq_ack_ptr(&g_tx_queue),
                             txfq_ack_len(&g_tx_queue),
                             CIPSEND_TX_PRIORITY_CRITICAL, CIPSEND_TX_TAG_ACK,
                             mono_now_ms())) {
            hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_ACK, mono_now_ms());
        }
        return;   /* 保持 ACK 顺序：STATUS 延后 */
    }

    /* --- STATUS: retry existing or fetch new from transport --- */
    status_was_retained = txfq_has_status(&g_tx_queue);
    if (!status_was_retained && esp_transport_has_pending_status()) {
        char tmp[TX_FRAME_QUEUE_LINE_MAX + 1U];
        uint16_t n = esp_transport_get_pending_status(tmp, sizeof(tmp));
        txfq_retain_status(&g_tx_queue, tmp, n);
    }
    if (txfq_has_status(&g_tx_queue)) {
        if (status_was_retained) hstats_status_retry(&g_health_stats);
        build_cipsend_cmd(cmd, txfq_status_len(&g_tx_queue));
        if (cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                             (const uint8_t *)txfq_status_ptr(&g_tx_queue),
                             txfq_status_len(&g_tx_queue),
                             CIPSEND_TX_PRIORITY_CRITICAL, CIPSEND_TX_TAG_STATUS,
                             mono_now_ms())) {
            hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_STATUS, mono_now_ms());
        }
        return;
    }

    /* --- Clock sync response: after safety frames, before telemetry --- */
    if (esp_transport_has_pending_clock_sync()) {
        uint32_t start_tick_ms = mono_now_ms();
        if (esp_transport_peek_pending_clock_sync(&s_clock_sync_inflight)) {
            uint16_t clock_sync_len = TWIN_CONTROL_CLOCK_SYNC_FRAME_LEN;
            build_cipsend_cmd(cmd, clock_sync_len);
            if (cipsend_tx_start_late_data(
                    &g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                    clock_sync_len, CIPSEND_TX_PRIORITY_CRITICAL,
                    CIPSEND_TX_TAG_CLOCK_SYNC, start_tick_ms,
                    fill_clock_sync_payload, &s_clock_sync_inflight)) {
                hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_CLOCK_SYNC,
                                  start_tick_ms);
            }
        }
        return;
    }

    /* --- Telemetry (latest-wins slot) --- */
    if (allow_telemetry) ESP_TrySendTelemetry();
}

