0hello-bit/Robot_twin/数字孪生/firmware/stm32_line_follower/User/main.c
/******************************************************************************
 * 以下为小车_改原封不动的算法 + 参数
 ******************************************************************************/

#define PID_KP                  35.0f
#define PID_KD                  10.0f

#define SPEED_MAX               680
#define SPEED_MIN               260
#define SPEED_ERR_DECAY         22.0f
#define SPEED_INIT              400.0f

#define TURN_LIMIT              600

#define ERR_OUTER               2.5f
#define ERR_INNER               0.45f

#define TURN_GAIN_K             0.9f

#define ERR_FILTER_OLD          0.65f
#define ERR_FILTER_NEW          0.35f
#define SPEED_FILTER_OLD        0.75f
#define SPEED_FILTER_NEW        0.25f
#define TURN_FILTER_OLD         0.55f
#define TURN_FILTER_NEW         0.45f
#define MOTOR_FILTER_OLD        0.15f
#define MOTOR_FILTER_NEW        0.85f

#define CURVE_REVERSE_ERR       1.0f
#define CURVE_REVERSE_POS       1
#define CURVE_INNER_REVERSE    -260
#define CURVE_MIN_TURN_EXTRA    60
#define CURVE_MID_INNER_REVERSE -120
#define CURVE_MID_TURN_EXTRA    20

#define PATTERN_LEFT_OUTER      0x08
#define PATTERN_LEFT_HEAVY      0x0C
#define PATTERN_LEFT_INNER      0x04
#define PATTERN_RIGHT_INNER     0x02
#define PATTERN_RIGHT_HEAVY     0x03
#define PATTERN_RIGHT_OUTER     0x01

#define D_LIMIT                 0.8f
#define SENSOR_STABLE_COUNT     0
#define LOST_HOLD_COUNT         3
#define LOST_FAST_OUTER         600
#define LOST_FAST_INNER        -200
#define MOTOR_LIMIT             650
#define LOOP_DELAY_MS           5

#define USART1_BAUDRATE         38400

static int clamp(int v, int min, int max)
{
    if (v > max) return max;
    if (v < min) return min;
    return v;
}

static float sm_l = 0, sm_r = 0;

static void MotorOut(int l, int r)
{
    l = clamp(l, -MOTOR_LIMIT, MOTOR_LIMIT);
    r = clamp(r, -MOTOR_LIMIT, MOTOR_LIMIT);
    sm_l = sm_l * MOTOR_FILTER_OLD + l * MOTOR_FILTER_NEW;
    sm_r = sm_r * MOTOR_FILTER_OLD + r * MOTOR_FILTER_NEW;

    if (sm_l >= 0)
    {
        Motor1_SetSpeed(0, (int)sm_l);
        Motor4_SetSpeed(0, (int)sm_l);
    }
    else
    {
        Motor1_SetSpeed(1, (int)(-sm_l));
        Motor4_SetSpeed(1, (int)(-sm_l));
    }

    if (sm_r >= 0)
    {
        Motor2_SetSpeed(0, (int)sm_r);
        Motor3_SetSpeed(0, (int)sm_r);
    }
    else
    {
        Motor2_SetSpeed(1, (int)(-sm_r));
        Motor3_SetSpeed(1, (int)(-sm_r));
    }
}

static void MotorTargetsZero(void)
{
    sm_l = 0;
    sm_r = 0;
    Motor1_SetSpeed(0, 0);
    Motor2_SetSpeed(0, 0);
    Motor3_SetSpeed(0, 0);
    Motor4_SetSpeed(0, 0);
}

/* If the one-shot diagnostic is armed, capture TIM2/TIM4 registers and send
   exactly one frame.  Call after each MotorOut call.  No effect otherwise.
   The armed flag is consumed AFTER the send attempt so a disconnected ESP
   does not permanently lose the diagnostic — but we do NOT retry on failure
   because snapshot registers may have changed by the next loop iteration. */
static void Diag_CaptureAndSendOnce(void)
{
    if (!diag_one_shot_peek(&g_diag_state)) return;

    MotorRegSnapshot snap;
    snap.regs[0]  = TIM2->CR1;
    snap.regs[1]  = TIM2->ARR;
    snap.regs[2]  = TIM2->CCR1;
    snap.regs[3]  = TIM2->CCR2;
    snap.regs[4]  = TIM2->CCR3;
    snap.regs[5]  = TIM2->CCR4;
    snap.regs[6]  = TIM4->CR1;
    snap.regs[7]  = TIM4->ARR;
    snap.regs[8]  = TIM4->CCR1;
    snap.regs[9]  = TIM4->CCR2;
    snap.regs[10] = TIM4->CCR3;
    snap.regs[11] = TIM4->CCR4;

    uint8_t diag_buf[MOTOR_REG_DIAG_FRAME_SIZE];
    motor_reg_diag_encode(diag_buf, &snap);

    /* Attempt send.  If ESP is disconnected (no TCP client), the frame
       is dropped silently.  Consume the arm regardless — we do NOT retry
       with stale register values on a later loop iteration. */
    ESP_SendDiagFrame(diag_buf, MOTOR_REG_DIAG_FRAME_SIZE);

    /* Clear the armed flag — one attempt per transition. */
    diag_one_shot_consume(&g_diag_state);
}

/* ── Health baseline: 每轮健康迭代 + 1Hz 0x02 发射 ──────────────────── */

/* 主循环每轮迭代顶部调用一次（设计 §4.1）。 */
static void health_loop_tick(uint32_t now_ms)
{
    hstats_loop_tick(&g_health_stats, now_ms);
    if (twin_control_consume_heartbeat_pending()) {
        twin_control_heartbeat(now_ms);
    }
    if (twin_control_heartbeat_tick(now_ms)) {
        MotorTargetsZero();   /* 租约到期 → 同轮四路归零 */
    }
    iwdg_feed();              /* 喂狗：证明上一轮已返回循环顶部 */
}

/* 1Hz 0x02 健康帧发射。归类顺序按 Round 3 项 3：busy 分支 generated+dropped
   后退出；可发送分支先以“截至上一笔已归类尝试”的计数填快照并编码 → 随后
   generated++ → start，成功 started++（ESP_SendDiagFrame 内部钩子）、失败
   dropped++。 */
static void health_emit(void)
{
    uint32_t now_ms = mono_now_ms();
    HealthSnapshot snap;
    uint8_t buf[HEALTH_FRAME_TOTAL_LEN];

    if ((uint32_t)(now_ms - s_last_health_ms) < 1000U) return;
    s_last_health_ms = now_ms;

    /* 先填快照（值 = 归类前计数，设计 §5.2 Round 3 项 3），再编码，再 generated++。
       （原"忙/有 A/S 重试 → 放弃"分支已改为延迟不丢，见下方 gate_defer。） */
    memset(&snap, 0, sizeof(snap));
    snap.fw_schema_version = HEALTH_FRAME_FW_SCHEMA_VERSION;
    snap.fw_build_id       = FW_BUILD_ID;
    snap.reset_cause       = g_reset_cause;
    snap.motion_state      = twin_control_health_motion_state();
    snap.lease_active      = twin_control_lease_active(now_ms);
    snap.heartbeat_last_reason = twin_control_heartbeat_last_reason();
    snap.heartbeat_timeout_count = twin_control_heartbeat_timeout_count();
    snap.heartbeat_count   = twin_control_heartbeat_count();
    snap.heartbeat_age_ms  = twin_control_heartbeat_age_ms(now_ms);
    snap.connection_generation = esp_transport_connection_generation();
    /* P0-3: boundary_aborts 单一来源 = health_stats（hstats_fill_health 从
       s->boundary_aborts 读取，coordinator do_abort 已调用 hstats_boundary_abort）。
       不再用 coordinator.boundary_events 在此覆盖（会被 fill_health 覆盖）。 */
    snap.uart_rx_bytes     = g_uart_ring.rx_bytes;
    snap.uart_tx_bytes     = g_uart_tx_ring.rx_bytes;
    snap.uart_rx_overflow  = (uint16_t)g_uart_ring.overflow_drops;
    snap.uart_tx_overflow  = (uint16_t)g_uart_tx_ring.overflow_drops;
    snap.uart_ore_events   = (uint16_t)g_uart_ring.ore_events;
    snap.uart_rx_high_water = g_uart_ring.high_water;
    snap.uart_tx_high_water = g_uart_tx_ring.high_water;
    hstats_fill_health(&g_health_stats, now_ms, &snap);

    health_frame_encode(buf, &snap);

    hstats_health_generated(&g_health_stats);

    /* 发送仲裁：TX 空闲且无 A/S 待发 → 立即发；否则延迟（不丢），由
       health_flush_pending 在 TX 空闲时补发——保证 1Hz 健康帧不被普通遥测
       永久饿死。ACK/STATUS 严格最高优先级：除 txfq 已保留的重试外，还检查
       transport 中本轮新解析的 ACK/STATUS（R1：同轮竞争修复，health 启动前
       必须可见新 A/S）。 */
    {
        uint8_t ack_status_pending =
            txfq_has_retry(&g_tx_queue)
            || esp_transport_has_pending_ack()
            || esp_transport_has_pending_status();
        if (hstats_health_gate_defer(&g_health_stats,
                                     (uint8_t)(cipsend_tx_busy(&g_cipsend_tx)
                                               || !s_control_cycle_ready),
                                     ack_status_pending)) {
        if (!ESP_SendDiagFrame(buf, HEALTH_FRAME_TOTAL_LEN)) {
            hstats_health_dropped(&g_health_stats);   /* start 失败 */
        }
    } else {
        uint8_t i;
        /* 延迟：保存帧供 flush 补发。被下一帧顶替时旧帧已在 gate_defer 计 dropped。 */
        for (i = 0U; i < HEALTH_FRAME_TOTAL_LEN; i++) s_health_frame[i] = buf[i];
    }
    }
}

/* 发送仲裁：补发延迟的健康帧（TX 空闲且无 A/S 重试时）。主循环在
   ESP_SendQueuedFrames 之后调用；断连/无客户端 → 放弃待发帧。 */
static void health_flush_pending(void)
{
    if (!s_control_cycle_ready) return;
    if (!hstats_health_can_flush(&g_health_stats,
                                 cipsend_tx_busy(&g_cipsend_tx),
                                 txfq_has_retry(&g_tx_queue))) {
        return;
    }
    /* 断连/无有效客户端 → 放弃待发帧（不得发给新代次）。 */
    if (!g_tcp_client_connected || g_tcp_client_id > 4) {
        hstats_health_epoch_changed(&g_health_stats);
        return;
    }
    hstats_health_consume_due(&g_health_stats);
    if (!ESP_SendDiagFrame(s_health_frame, HEALTH_FRAME_TOTAL_LEN)) {
        hstats_health_dropped(&g_health_stats);   /* start 失败 */
    }
}

static void ESP_DrainPendingStatus(void)
{
    if (esp_transport_can_queue_status()) {
        TwinControlStatus st;
        if (twin_control_consume_pending_status(&st)) {
            esp_transport_queue_status(&st);
        }
    }
}

