0hello-bit/Robot_twin/数字孪生/firmware/stm32_line_follower/User/main.c
/* Release droppable TX only after sensor/control decisions for this loop are
   complete.  Newly-generated LINE_LOST status is materialized first, then
   ACK/STATUS are sent before health and telemetry. */
static void ESP_FlushAfterControl(void)
{
    s_control_cycle_ready = 1U;
    ESP_DrainPendingStatus();
    ESP_SendQueuedFrames(1U);
    health_flush_pending();
    ESP_TrySendImuDiagnostic();
}

int main(void)
{
    /* Health baseline: 开机最早读 RCC->CSR 复位原因位快照，随后清 RMVF，
       使下一次复位原因独立可判（IWDGRST 位可证明看门狗复位，设计 §5.4）。
       P0-1：必须用纯函数取高字节复位标志（PORRSTF bit27→0x08、IWDGRSTF
       bit29→0x20…），原 `RCC->CSR & 0x1F` 取到的是低位 LSI 状态，无法报告
       POR/IWDG。 */
    g_reset_cause = health_reset_cause_from_csr(RCC->CSR);
    RCC->CSR |= RCC_CSR_RMVF;

    Sensor_Init();
    Motor_Init();
    USART1_Init(USART1_BAUDRATE);

    /* Task 4B-4 fix: 真实单调毫秒时钟源（TIM3 1kHz），独立于主循环和
       Delay_ms()。必须在任何 mono_now_ms() 调用前初始化。 */
    mono_time_init();

    ESP_Setup();

    /* Initialise the SPSC UART RX/TX rings and enable USART1 RXNE + TXE
       interrupts.  Must happen AFTER ESP_Setup (which uses polling TX and
       blocking Delay_ms) and BEFORE the main loop (which reads the RX ring
       and pushes to the TX ring).  The RX ring is cleared first so any
       stale bytes in the USART1 DR are captured by the ISR, not mistaken
       for fresh data. */
    uart_ring_init(&g_uart_ring);
    uart_ring_init(&g_uart_tx_ring);
    USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    NVIC_EnableIRQ(USART1_IRQn);

    /* Task 4B-4 fix: 非阻塞 CIPSEND TX 状态机初始化。 */
    cipsend_tx_init(&g_cipsend_tx);
    /* Task 4B-4 fix (Codex review remediation): 发送队列（连接代次隔离）初始化。 */
    txfq_init(&g_tx_queue);
    telemetry_delivery_init(&s_tele_delivery);

    /* Read identity once through hardware I2C2 before the normal software-I2C
       initialization.  This is read-only and motion-inhibited. */
    (void)MPU6050_ReadHardwareID();
    /* MPU6050 IMU */
    MPU6050_Init();
    /* yaw dt 基准：初始化为当前单调毫秒，首次 dt 由 clamp 保护。 */
    s_last_yaw_ms = mono_now_ms();

    const TwinControlParams baseline_params = {
        PID_KP, 0.0f, PID_KD, SPEED_MAX, 1U, "baseline"
    };
    TwinControlParams active_params = baseline_params;
    twin_control_init(&baseline_params);
    esp_transport_init(&g_tcp_client_connected, &g_tcp_client_id);

    /* Task 4B-4 final fix: TX connection-boundary coordinator.
       Initialised after cipsend_tx, txfq, and transport so all
       referenced modules are ready.  discard_tx_ring_cb abstracts
       the UART TX ring so the coordinator is Host-testable. */
    hstats_init(&g_health_stats);
    etc_init(&g_coordinator, &g_cipsend_tx, &g_tx_queue,
              &s_tele_delivery.pending.count, &g_health_stats,
             discard_tx_ring_cb, NULL);
    etc_set_telemetry_clear(&g_coordinator, clear_telemetry_batch_cb,
                            &s_tele_delivery);

    /* Task 2B: queue the INIT/MOTION_INHIBITED status event for PC visibility. */
    {
        TwinControlStatus st;
        if (twin_control_consume_pending_status(&st)) {
            esp_transport_queue_status(&st);
        }
    }

    /* Initialise diagnostic one-shot state.  Boot starts inhibited,
       so was_inhibited = 1.  The first transition to running will
       arm the one-shot diagnostic frame. */
    diag_one_shot_init(&g_diag_state);

    float last_err = 0;
    float integral_error = 0;
    int last_dir = 1;
    int lost_step = 0;
    float sm_err = 0;
    float sm_speed = SPEED_INIT;
    float sm_turn = 0;
    uint8_t last_pattern = 0;
    uint8_t stable_pattern = 0;
    uint8_t same_count = 0;

    /* Health baseline: 安全初始化完成、电机已归零（boot 抑制态）、ESP_Setup
       阻塞延时全部结束后启用 IWDG（设计 §6.2）。 */
    iwdg_init_and_enable();

    while (1)
    {
        s_control_cycle_ready = 0U;

        /* Health baseline: 每轮迭代顶部采样（时序/喂狗基准，设计 §4.1）。 */
        health_loop_tick(mono_now_ms());

        /* Task 4B-4 final fix: three-phase ESP service.
           Phase 1 — drain RX (may detect CONNECT/CLOSED).
           Phase 2+3 — check connection boundary, then push TX.
           The coordinator ensures no old-epoch byte reaches the ESP
           after a connection boundary (see design decision §5). */
        ESP_ServiceRX();
        ESP_ServiceTX();

        /* Task 2B: detect fresh TCP CONNECT → queue authoritative state.
           The transport layer clears stale pending status on CONNECT. */
        if (g_tcp_client_connected && !g_prev_connected) {
            twin_control_queue_authoritative_status();
        }
        g_prev_connected = g_tcp_client_connected;

        esp_transport_apply_and_ack(&active_params, &baseline_params);

        /* Materialize protocol status events before any droppable TX. */
        ESP_DrainPendingStatus();

        /* R1（Codex）：1Hz 0x02 发射必须在本轮新 ACK/STATUS 物化/可见之后。
           此前 health_emit 在 ESP_ServiceRX 之前运行，新 ACK/STATUS 还在 UART
           RX 环里未被解析，health 可能抢在新 ACK/STATUS 前启动（同轮竞争漏洞）。
           现在 RX 已解析、apply_and_ack 与权威状态重发已把新 A/S 放入 transport
           pending；health_emit 内部再检查这些 pending 标志后才决定是否发射。 */
        health_emit();

        /* Before sensor/control work, service only critical ACK/STATUS. */
        ESP_SendQueuedFrames(0U);
        health_flush_pending();   /* 发送仲裁：补发延迟的健康帧（遥测让行） */

        /* Task 2B: if the controller state needs reset (new params, rollback),
           clear integral term and last error to prevent cross-candidate pollution. */
        if (twin_control_consume_controller_reset_flag()) {
            integral_error = 0.0f;
            last_err = 0.0f;
        }

        if (twin_control_motion_inhibited())
        {
            /* Reset diagnostic one-shot when motion becomes inhibited.
               Both the armed flag and the inhibition-tracking state are
               updated so a future transition to running re-arms once. */
            diag_one_shot_update(&g_diag_state, 1);
            MotorTargetsZero();
            ESP_FlushAfterControl();
            Delay_ms(LOOP_DELAY_MS);
            continue;
        }

